# 현재 상황
- 10년 이상 지난 컴퓨터를 사용하면서 자잘한 불편 사항들이 발견되고 있기에 이를 해결하고자 함.
- 아마 앞으로 계속 알아보고 개선해야 하지 않을까 싶다.

# Ep.01 유물 발굴하기
## 노트북 딱딱 소리 문제

예상 원인

1. 하드디스크 쪽 문제
2. 쿨링 팬 쪽 문제 → 근데 이건 주요 원인이라기 보다는 냄새의 원인일듯.. 꿉꿉한 냄새가 난다
3. 오디오 문제

일단 냄새도 해결해야 해서.. 간단하게 하단 분리 후 청소하기로 결정

급하게 일단 다이소에서 드라이버 사옴

나사 뽑고 카드로 쑤셔서 케이스 뜯는데 너무 힘들었다… 근데 삽질하느라 한 번 더 뜯으니까 약간 요령이 생김(?)

[IMG_3331.pdf](https://github.com/user-attachments/files/19401329/IMG_3331.pdf)

케이스 안 쪽 면이 이렇게 그을린 것 같이 되어 있는데 실제로 타서 이런 건지는 모르겠다 근데 그렇다기엔 스티커는 또 깨끗하고 뭐지

[IMG_3332.pdf](https://github.com/user-attachments/files/19401327/IMG_3332.pdf)

[IMG_3333.pdf](https://github.com/user-attachments/files/19401331/IMG_3333.pdf)

생각보다 보드 쪽은 멀쩡하게 보인다.

스피커 쪽 문제인가 싶었지만 외관상으로는 찢어진 부분도 없고 괜찮다 

→ 근데 사실 나중에 듣다 보니 오른쪽 스피커 부분에서 딱딱 소리가 나는 것 같기도 하다

[IMG_3334.pdf](https://github.com/user-attachments/files/19401328/IMG_3334.pdf)

구동 시 꿉꿉한 냄새도 문제였기에 가생이에 오염 부분들을 닦고 쿨러 쪽도 최대한 청소했다.

[IMG_3335.pdf](https://github.com/user-attachments/files/19401330/IMG_3335.pdf)

나사 풀어서 최대한 먼지만 제거하고 재조립했다

배터리 아래에 혹시 탄 부분 있을까봐 나사를 풀었었는데

저 PUSH라고 적혀있는 부분을 어떻게 분해하는지 몰라서 일단 냅뒀다

살짝 들어서 최대한 봤을 때에는 탄 흔적 같은건 없긴 했다.

[IMG_3336.pdf](https://github.com/user-attachments/files/19401326/IMG_3336.pdf)

분해의 역순으로 조립하고 나니 전원은 정상적으로 작동했다.

근데 케이스 뜯으면 컴퓨터가 인지를 하는지 평소와는 약간 다른 과정으로 부팅하던데

이를 컴퓨터가 따로 인지하는 버튼? 같은 것이 있는 건지 궁금하다.

뭐 딱히 내부 부품에서 나사를 건들지 않아도 평소와는 다르게 부팅했다.
